tutorials/surfaceTracking/interTrackFoam/hydrofoil/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    bottom
    {
        type zeroGradient;
    }

    hydrofoil
    {
        type zeroGradient;
    }

    freeSurface
    {
        type fixedValue;
        value uniform 0.0;
    }

    outlet
    {
        type zeroGradient;
    }

    inlet
    {
        type zeroGradient;
    }

    frontAndBackPlanes
    {
        type empty;
    }   
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
